In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df=pd.read_csv("Book1.csv")

In [4]:
df

      Name  Gender  DSBDA  WT    AI    CC  CGPA
0     John    Male   55.0  89  98.0   NaN    82
1   Shruti  Female   75.0  56  76.0  78.0    78
2   Sakshi  Female   65.0  90  56.0   NaN    83
3   Shreya  Female   45.0  88   NaN  87.0    76
4  Shreyas    Male   98.0  76  74.0  90.0    89
5    Sujay    Male    NaN  87  70.0  84.0    80

In [6]:
df.isnull().sum()

Name      0
Gender    0
DSBDA     1
WT        0
AI        1
CC        2
CGPA      0
dtype: int64